tutorials/immersedBoundary/pitzDaily/Turbulent/kOmegaSST/mapp/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    pitzDailyIB
    {
        type            immersedBoundary;
        nFaces          0;
        startFace       478760;
        internalFlow    yes;
        isWall          yes;
    }
    top
    {
        type            patch;
        nFaces          1000;
        startFace       478760;
    }
    inlet
    {
        type            patch;
        nFaces          240;
        startFace       479760;
    }
    outlet
    {
        type            patch;
        nFaces          240;
        startFace       480000;
    }
    bottom
    {
        type            patch;
        nFaces          1000;
        startFace       480240;
    }
    frontAndBack
    {
        type            empty;
        nFaces          480000;
        startFace       481240;
    }
)


// ************************************************************************* //
